Revit 2024 API
DuctFittingAndAccessoryData Methods
The DuctFittingAndAccessoryData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllConnectorData
 Gets the connector data of the pipe fitting or pipe accessory.
GetEntity
 Returns an Entity of the Schema of the serverGUID. or an invalid entity otherwise.
GetFamilyInstanceId
 Gets the Id of the fiting or accessory instance
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace